# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [2]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd

In [3]:
# Your code here; create the connection
conn = sqlite3.Connection("data/data.sqlite")

### Q.1 Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [43]:
# Your code here
q2 = """
Select 
    customerNumber,
    contactLastName,
    contactFirstName
From customers
Where customerNumber In(
    Select customerNumber
    From orders
    Where orderDate = '2003-01-31'
)

;
"""


q2_result = pd.read_sql(q2, conn)
q2_result

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

### Q.2 Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [44]:
# Your code here
q2 = """
Select 
    productName As Product_Name,
    quantityOrdered As total_num_of_items_sold
    
From
    orderdetails
    Inner Join products On orderdetails.productCode = products.productCode
      
    
    
;
"""


q2_result = pd.read_sql(q2, conn)
q2_result

                             Product_Name  total_num_of_items_sold
0                1917 Grand Touring Sedan                       30
1                      1911 Ford Town Car                       50
2     1932 Alfa Romeo 8C2300 Spider Sport                       22
3        1936 Mercedes Benz 500k Roadster                       49
4               1932 Model A Ford J-Coupe                       25
...                                   ...                      ...
2991             1962 Volkswagen Microbus                       49
2992  1958 Chevy Corvette Limited Edition                       31
2993          1980’s GM Manhattan Express                       41
2994          1954 Greyhound Scenicruiser                       11
2995     Diamond T620 Semi-Skirted Tanker                       18

[2996 rows x 2 columns]

### Q.3 Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

**A quick note on the SQL  `SELECT DISTINCT` statement:**

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [45]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT
q2 = """

Select
    Distinct productName,
    quantityOrdered As Total_Number_Ordered
From 
    products
    Inner Join orderdetails On products.productCode = orderdetails.productCode
Group By 
    productName
    


;
"""


q2_result = pd.read_sql(q2, conn)
q2_result

                             productName  Total_Number_Ordered
0    18th Century Vintage Horse Carriage                    20
1                  18th century schooner                    21
2                 1900s Vintage Bi-Plane                    20
3                1900s Vintage Tri-Plane                    21
4                      1903 Ford Model A                    20
..                                   ...                   ...
104                        The Mayflower                    20
105                       The Queen Mary                    20
106                The Schooner Bluenose                    21
107                          The Titanic                    21
108            The USS Constitution Ship                    21

[109 rows x 2 columns]

### Q.4 Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [8]:
# Your code here
q2 = """
Select
    Distinct employeeNumber,
    firstName,
    lastName,
    city,
    offices.officeCode
From employees
    Join offices On offices.officeCode = employees.officeCode
    Join customers On employees.employeeNumber = customers.salesRepEmployeeNumber
Where 
Group By employees.employeeNumber, 
    
;
"""


q2_result = pd.read_sql(q2, conn)
q2_result

DatabaseError: Execution failed on sql '
Select
    Distinct employeeNumber,
    firstName,
    lastName,
    city,
    offices.officeCode
From employees
    Inner Join offices On offices.officeCode = employees.officeCode
    Inner Join customers On employee.employeeNumber = customers.salesRepEmployeeNumber









Where
    (
    Select
        salesRepEmployeeNumber,
        employees.employeeNumber
    From
        customers
        Inner Join employees On employees.employeeNumber = customers.salesRepEmployeeNumber
    Group By employeeNumber



)

;
': ambiguous column name: city

### Q.5 Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [ ]:
# Your code here
q2 = """
SELECT employeeNumber, firstName, lastName, COUNT(customerNumber)
FROM employees
JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
WHERE AVG(creditLimit) > 15000
GROUP BY employeeNumber;
;
"""


q2_result = pd.read_sql(q2, conn)
q2_result

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!